
alert(` Завдання 1
   Дано масив чисел. Потрібно визначити, чи є у ньому хоча б одне від'ємне число. 
   Якщо є, то повернути масив, в якому кожен елемент масиву буде додатнім числом.
   Вхідні дані: масив чисел.
   Вихідні дані: масив додатніх чисел або повідомлення "No negative numbers found".
   Приклад вхідних даних: const arr = [3, -2, 5, 6, -8, 2];`);

const arr = [3, -2, 5, 6, -8, 2],
    filterArr = arr.filter(arr => arr < 0).map(arr=>arr*-1);

alert(`рішеня:
    const arr = [3, -2, 5, 6, -8, 2],
          filterArr = arr.filter(arr => arr < 0).map(arr=>arr*-1);   
    результат = [${filterArr}]
`);

alert(`Завдання 2
  Дано масив чисел. Потрібно знайти суму всіх додатних чисел у масиві, які є кратними числу 3.
  Вхідні дані: масив чисел
  Вихідні дані: сума всіх додатних чисел у масиві, які є кратними числу 3.
  Приклад вхідних даних: [3, 5, -9, 7, 2, 8, 10, -6]
  Приклад вихідних даних: 9
`);

const array = [3, 5, -9, 7, 2, 8, 10, -6],
      mapArr = array.map(arr=>arr%3).reduce((acc,num) => acc + num, 1);

alert(`рішеня:
     const array = [3, 5, -9, 7, 2, 8, 10, -6],
           mapArr = array.map(arr=>arr%3).reduce((acc,num) => acc + num, 1);
     результат = ${mapArr}
`);

